In [1]:
# Vorbereitungen
import pandas as pd

In [2]:
# Datensatz einlesen
df = pd.read_csv('datasets/data_one.csv')

In [3]:
# Datensatz einsehen (I)
print(df.columns.values)

['pclass' 'survived' 'name' 'sex' 'age' 'sibsp' 'parch' 'ticket' 'fare'
 'cabin' 'embarked' 'boat' 'body' 'home.dest']

In [4]:
# Datensatz einsehen (II)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,"211,3375",B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,"0,9167",1,2,113781,"151,5500",C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,"151,5500",C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
# Listen und Elemente (I)
list(df.sex[0:5])

['female', 'male', 'female', 'male', 'female']

In [6]:
# Listen und Elemente (II)
neues_objekt = df.sex[0:5]
neues_objekt[0] = "male"
neues_objekt

0      male
1      male
2    female
3      male
4    female
Name: sex, dtype: object

In [7]:
# Listen und Elemente (III)
ein_neues_objekt = df.pclass[0:5]
noch_ein_neues_objekt = ein_neues_objekt * 2
noch_ein_neues_objekt

0    2
1    2
2    2
3    2
4    2
Name: pclass, dtype: int64

In [8]:
# Tuples (I)
neuer_tuple = (1, 2, 3, "female", "male")
neuer_tuple

(1, 2, 3, 'female', 'male')

In [9]:
# Tuples (II)
neuer_tuple * 2

(1, 2, 3, 'female', 'male', 1, 2, 3, 'female', 'male')

In [10]:
# Stacks (I)
neues_stack = [1, 2, 3]
neues_stack.append(4)
neues_stack

[1, 2, 3, 4]

In [11]:
# Stacks (II)
neues_stack.pop()
neues_stack

[1, 2, 3]

In [12]:
# Variablenauswahl
print("Alle Variablen:", df.shape)
smaller_df = df.drop(['ticket', 'cabin'], axis='columns')
print("Variablenauswahl:", smaller_df.shape)

Alle Variablen: (1309, 14)
Variablenauswahl: (1309, 12)

In [13]:
# Fehlwerte
df['boat'].isna().sum()

np.int64(823)

In [14]:
# Featureübergreifende Zusammenhänge
df[['pclass', 'survived']].groupby(['pclass'], as_index=False).mean().sort_values(by='survived', ascending=False)

   pclass  survived
0       1  0.619195
1       2  0.429603
2       3  0.255289